In [379]:
import numpy as np
import pandas as pd
import os
import lxml
import requests

- Pandas is a library in Python used for data manipulation and analysis.
- Exterimly powerful table built on top of numpy.
- Provides data structures like Series (1D) and DataFrame (2D).
- Common operations include reading/writing data, filtering, grouping, and aggregating.
- Example usage:
```python
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
data = pd.DataFrame(data)
print(data)
```
**What can do with Pandas?**
- Data Cleaning: Handling missing values, duplicates, and data type conversions.
- Data Transformation: Merging, joining, and reshaping datasets.
- Data Analysis: Grouping data, calculating statistics, and generating summaries.
- Data Visualization: Integrating with libraries like Matplotlib and Seaborn for plotting.
- Time Series Analysis: Handling date-time data and performing time-based operations.
- Input/Output: Reading from and writing to various file formats like CSV, Excel, SQL databases, and more.

In [2]:
data2 = {
    "Name" : ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35]
}

In [3]:
data = pd.DataFrame(data2, columns=list(["Name"]))

In [4]:
data

      Name
0    Alice
1      Bob
2  Charlie

## Pandas Series
- A Pandas Series is a one-dimensional labeled array capable of holding any data type.
- It consists of two main components: the data and the index (labels).
- You can create a Series from a list, dictionary, or scalar value.
```python
import pandas as pd
data = [10, 20, 30, 40]
series = pd.Series(data)
print(series)
```

In [5]:
data = [10, 20, 30, 40]
series = pd.Series(data, dtype="int32")

In [6]:
series.dtype

dtype('int32')

In [7]:
series

0    10
1    20
2    30
3    40
dtype: int32

In [8]:
series.index = list("ABCD")

In [9]:
series

A    10
B    20
C    30
D    40
dtype: int32

In [10]:
myIndex = ["USA", "CANADA", "MEXICO"]
myData = [1776, 1867, 1821]

In [11]:
mySer = pd.Series(data=myData, index=myIndex)

In [12]:
mySer

USA       1776
CANADA    1867
MEXICO    1821
dtype: int64

In [13]:
mySer.iloc[1]

1867

In [14]:
ages = {'Sam' : [5,2], "Frank": [10,3], "Spike":[7,9]}

In [15]:
pd.Series(ages)

Sam       [5, 2]
Frank    [10, 3]
Spike     [7, 9]
dtype: object

In [16]:
pd.DataFrame(ages, index=list("ab")) #Test

   Sam  Frank  Spike
a    5     10      7
b    2      3      9

In [17]:
pd.DataFrame(np.arange(20).reshape((5,4)), columns=list("ABCD"), index=[f"Value: {x + 1}" for x in range(5)]) # Test

           A   B   C   D
Value: 1   0   1   2   3
Value: 2   4   5   6   7
Value: 3   8   9  10  11
Value: 4  12  13  14  15
Value: 5  16  17  18  19

In [18]:
# Imaginary Sales Data for 1st and 2nd Quarters for Global Company
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [19]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [20]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [21]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [22]:
pd.Series.sum(sales_q1, axis=0)

980

In [23]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [24]:
type(sales_q1)

pandas.core.series.Series

In [25]:
sales_q1["Japan"]

80

In [26]:
sales_q1.iloc[0]

80

In [27]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [28]:
sales_q1[sales_q1.keys()[1]]

450

In [29]:
[1,2] * 2 # In Python

[1, 2, 1, 2]

In [30]:
sales_q1 * 2 # It will multiply every value with 2 in pandas

Japan    160
China    900
India    400
USA      500
dtype: int64

In [31]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [32]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [33]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [34]:
first_half = sales_q1.add(sales_q2, fill_value=0) # If there is no value it fills value with 0

In [35]:
first_half

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [36]:
pd.Series(np.arange(15),dtype="int32")

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int32

## Pandas DataFrame
- A Pandas DataFrame is a two-dimensional labeled data structure with columns of potentially different types.
- It is similar to a spreadsheet or SQL table.
- You can create a DataFrame from a dictionary, list of lists, or another DataFrame.
```python   
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
data = pd.DataFrame(data)
print(data)
```

In [37]:
import pandas as pd
data = {'Name': ['Alice', 'Charlie', 'Bob'], 'Age': [25, 30, 35]}
df = pd.DataFrame(data)

In [38]:
df.columns = data.keys()
df.index = list(data.values())[0]

In [39]:
df

            Name  Age
Alice      Alice   25
Charlie  Charlie   30
Bob          Bob   35

In [40]:
np.random.seed(101)
myData = np.random.randint(0, 101, (4,3))

In [41]:
myData

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [42]:
myIndex = ["California", "Arizona", "New York", "Texas"]

In [43]:
myColumns = ["Jan", "Feb", "March"]

In [44]:
df = pd.DataFrame(data=myData, index=myIndex, columns=myColumns)

In [45]:
df

            Jan  Feb  March
California   95   11     81
Arizona      70   63     87
New York     75    9     77
Texas        40    4     63

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, California to Texas
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int64
 1   Feb     4 non-null      int64
 2   March   4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [47]:
!ls -la

total 272
drwxr-xr-x@ 10 kemalozyon  staff    320 Nov 18 23:03 .
drwxr-xr-x@  7 kemalozyon  staff    224 Nov 16 11:59 ..
drwxr-xr-x@  9 kemalozyon  staff    288 Nov 18 22:10 .git
drwxr-xr-x@  3 kemalozyon  staff     96 Nov 18 18:43 .ipynb_checkpoints
drwxr-xr-x@ 10 kemalozyon  staff    320 Nov 18 21:56 .venv
-rw-r--r--@  1 kemalozyon  staff  51638 Nov 16 14:33 1-Numpy.ipynb
-rw-r--r--@  1 kemalozyon  staff  71495 Nov 18 23:12 2-Pandas.ipynb
-rw-r--r--@  1 kemalozyon  staff   1456 Nov 18 22:12 README.md
drwxr-xr-x@ 13 kemalozyon  staff    416 Nov 18 22:50 examples
-rw-r--r--@  1 kemalozyon  staff   4835 Nov 18 22:13 requirements.txt

In [48]:
!pwd

/Users/kemalozyon/MachineLearning/MLOverView

In [49]:
data = pd.read_csv("examples/test.csv")

In [50]:
data.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID',
       'Tip Persentage'],
      dtype='object')

In [51]:
data

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.358352
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.822232
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441

In [52]:
data.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679,18.623962
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985,22.805017
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157,11.607143
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,13.031915
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,21.853857

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
 11  Tip Persentage    244 non-null    float64
dtypes: float64(4), int64(2), object(6)
memory usage: 23.0+ KB

In [54]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15
Tip Persentage,244.0,1.608026e+01,6.107220e+00,3.563814e+00,1.291274e+01,1.547698e+01,1.914755e+01,7.103448e+01

In [55]:
data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15
Tip Persentage,244.0,1.608026e+01,6.107220e+00,3.563814e+00,1.291274e+01,1.547698e+01,1.914755e+01,7.103448e+01

In [56]:
type(data["total_bill"])

pandas.core.series.Series

In [57]:
data["total_bill"].max()

50.81

In [58]:
mycols = ["total_bill", "tip"]
data[data[mycols]["total_bill"] <= 10].count().loc["total_bill"]

17

In [59]:
data["Tip Persentage"] = 100 * data["tip"] / data["total_bill"]

In [60]:
data.to_csv("examples/test.csv", index=False)

In [61]:
gender_smoker_avg = data["sex"]

In [62]:
gender_smoker_avg.value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [63]:
data["price_per_person"] = np.round(data["total_bill"] / data["size"], 2);

In [64]:
data["tip_persentage"] = np.round(100 * data["tip"] / data["total_bill"], 2)

In [65]:
data.drop("tip_persentage", axis=1)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.358352
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.822232
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441

In [66]:
data

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage,tip_persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765,14.68
...,...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.358352,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.822232,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441,15.97

In [67]:
data

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage,tip_persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765,14.68
...,...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.358352,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.822232,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441,15.97

In [68]:
data = data.drop("tip_persentage", axis=1)

In [69]:
data = data.drop("Tip Persentage", axis=1)

In [70]:
data

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [71]:
data.shape[1]

11

In [72]:
data.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [73]:
data.index

RangeIndex(start=0, stop=244, step=1)

In [74]:
data.set_index("Payment ID")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [75]:
data.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [76]:
data = data.set_index("Payment ID")

In [77]:
data

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [78]:
data.reset_index()

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
1,Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
2,Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
3,Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
4,Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...,...
239,Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
240,Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
241,Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
242,Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
243,Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [79]:
data

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [80]:
data = data.reset_index()

In [81]:
data

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
1,Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
2,Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
3,Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
4,Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...,...
239,Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
240,Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
241,Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
242,Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
243,Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [82]:
data = data.set_index("Payment ID")

In [83]:
data.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221

In [84]:
data.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [85]:
data.loc["Sun2959"]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [86]:
data.iloc[0 : 4]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994

In [87]:
data.loc[["Sun2959", "Sun4458"]]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322

In [88]:
data.drop("Sun2959", axis=0)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [89]:
data.shape[0] # It is where the axis come from

244

In [90]:
data.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221

In [91]:
#Another way to drop rows
data.iloc[1:]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [92]:
data.iloc[10]

total_bill                  10.27
tip                          1.71
sex                          Male
smoker                         No
day                           Sun
time                       Dinner
size                            2
price_per_person             5.14
Payer Name          William Riley
CC Number            566287581219
Name: Sun2546, dtype: object

In [93]:
data_without_10 = pd.concat([data.iloc[:10], data.iloc[11:]])

In [94]:
data.iloc[10]

total_bill                  10.27
tip                          1.71
sex                          Male
smoker                         No
day                           Sun
time                       Dinner
size                            2
price_per_person             5.14
Payer Name          William Riley
CC Number            566287581219
Name: Sun2546, dtype: object

In [95]:
data.head(20)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882
Sun5985,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344
Sun8157,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092
Sun6820,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377
Sun3775,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786
Sun2546,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219
Sun6686,35.26,5.00,Female,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969
Sun1300,15.42,1.57,Male,No,Sun,Dinner,2,7.71,Chad Harrington,577040572932
Sun2971,18.43,3.00,Male,No,Sun,Dinner,4,4.61,Joshua Jones,6011163105616890
Sun3848,14.83,3.02,Female,No,Sun,Dinner,2,7.42,Vanessa Jones,30016702287574
Sun1878,21.58,3.92,Male,No,Sun,Dinner,2,10.79,Matthew Reilly,180073029785069
Sun9715,10.33,1.67,Female,No,Sun,Dinner,3,3.44,Elizabeth Foster,4240025044626033
Sun2998,16.29,3.71,Male,No,Sun,Dinner,3,5.43,John Pittman,6521340257218708
Sun2789,16.97,3.50,Female,No,Sun,Dinner,3,5.66,Laura Martinez,30422275171379
Sat9213,20.65,3.35,Male,No,Sat,Dinner,3,6.88,Timothy Oneal,6568069240986485

In [96]:
data_without_10.iloc[10]

total_bill                     35.26
tip                              5.0
sex                           Female
smoker                            No
day                              Sun
time                          Dinner
size                               4
price_per_person                8.82
Payer Name              Diane Macias
CC Number           4577817359320969
Name: Sun6686, dtype: object

In [97]:
one_row = data.iloc[0]

In [98]:
one_row

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [99]:
pd.concat([data,pd.DataFrame(one_row).T], ignore_index=True)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
2,21.01,3.5,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
240,27.18,2.0,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
241,22.67,2.0,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
243,18.78,3.0,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139
244,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410

In [100]:
data

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [101]:
pd.DataFrame(one_row).T

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410

In [102]:
df

            Jan  Feb  March
California   95   11     81
Arizona      70   63     87
New York     75    9     77
Texas        40    4     63

In [103]:
df["March"] > 77 
df["Feb"] > 12
result = [x and y for x, y in zip(df["March"]>77, df["Feb"]>12)]

In [104]:
myList = list(df["March"] > 77)

In [105]:
df[myList]

            Jan  Feb  March
California   95   11     81
Arizona      70   63     87

In [106]:
df[result]

         Jan  Feb  March
Arizona   70   63     87

In [107]:
df = pd.read_csv("examples/test.csv")

In [108]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [109]:
len(df) - len(df[df["smoker"] == "No"])

93

In [110]:
result = [x and y for x, y in zip(df["sex"] == "Female", df["smoker"]=="Yes")]

In [111]:
len(df[result]) # Female count who smokes

33

In [112]:
(len(df[result])/len(df[df["sex"] == "Female"])) * 100 # Percentage of woman who smokes

37.93103448275862

In [113]:
result = [x and y for x, y in zip(df["sex"] == "Male", df["smoker"]=="Yes")]

In [114]:
len(df[result]) # Male count who smokes

60

In [115]:
(len(df[result])/len(df[df["sex"] == "Male"])) * 100 # Percentage of men who smokes

38.21656050955414

In [116]:
np.average(df[df["sex"] == "Female"]["tip"])

2.8334482758620685

In [117]:
np.average(df[df["sex"] == "Male"]["tip"])

3.0896178343949043

In [118]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [119]:
len(df[(df["sex"] == "Female") & (df["smoker"] == "Yes")])

33

In [120]:
df["day"].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [121]:
np.sum(df[df["day"] == "Sun"]["total_bill"])

1627.16

In [122]:
np.sum(df[df["day"] == "Sat"]["total_bill"])

1778.3999999999999

In [123]:
np.sum(df[df["day"] == "Thur"]["total_bill"])

1096.33

In [124]:
np.sum(df[df["day"] == "Fri"]["total_bill"])

325.88

In [125]:
df[df["day"] == "Thur"]["total_bill"].mean()

17.682741935483868

In [126]:
df[df["day"].isin(["Fri", "Thur"])]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
77,27.20,4.00,Male,No,Thur,Lunch,4,6.80,John Davis,30344778738589,Thur4924,14.705882
78,22.76,3.00,Male,No,Thur,Lunch,2,11.38,Chris Hahn,3591887177014031,Thur2863,13.181019
79,17.29,2.71,Male,No,Thur,Lunch,2,8.64,Brian Diaz,4759290988169738,Thur9501,15.673800
80,19.44,3.00,Male,Yes,Thur,Lunch,2,9.72,Louis Torres,38848369968464,Thur6453,15.432099
81,16.66,3.40,Male,No,Thur,Lunch,2,8.33,William Martin,4550549048402707,Thur8232,20.408163
...,...,...,...,...,...,...,...,...,...,...,...,...
223,15.98,3.00,Female,No,Fri,Lunch,3,5.33,Mary Rivera,5343428579353069,Fri6014,18.773467
224,13.42,1.58,Male,Yes,Fri,Lunch,2,6.71,Ronald Vaughn DVM,341503466406403,Fri5959,11.773472
225,16.27,2.50,Female,Yes,Fri,Lunch,2,8.14,Whitney Arnold,3579111947217428,Fri6665,15.365704
226,10.09,2.00,Female,Yes,Fri,Lunch,2,5.04,Ruth Weiss,5268689490381635,Fri6359,19.821606
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441

In [127]:
def format(x):
    return f"{x:.2f}"

In [128]:
df["Tip Persentage"] = df["Tip Persentage"].apply(lambda x: float(f"{float(x):.2f}"))

In [129]:
df["Tip Persentage"]
df["CC Number"]

0      3560325168603410
1      4478071379779230
2      6011812112971322
3      4676137647685994
4      4832732618637221
             ...
239    5296068606052842
240    3506806155565404
241    6011891618747196
242       4375220550950
243    3511451626698139
Name: CC Number, Length: 244, dtype: int64

In [130]:
def grabLast(x):
    return x % 10_000

In [131]:
arr = np.array(df["CC Number"].apply(lambda x: x % 10_000))

In [132]:
arr.sum()

1215482

In [133]:
arr.mean()

4981.483606557377

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
 11  Tip Persentage    244 non-null    float64
dtypes: float64(4), int64(2), object(6)
memory usage: 23.0+ KB

In [135]:
#Second Method
df["last_four"] = df["CC Number"].apply(lambda x: int(str(x)[-4:]))

In [136]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage,last_four
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.94,3410
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.05,9230
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.66,1322
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.98,5994
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.68,7221
...,...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.39,2842
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.36,5404
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.82,7196
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.82,950
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.97,8139

In [137]:
def assignDollar(x):
    if x < 20:
        return "$"
    elif x < 40:
        return "$$"
    else:
        return "$$$"

In [138]:
df["Pricy"] = df["total_bill"].apply(assignDollar)

In [139]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage,last_four,Pricy
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.94,3410,$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.05,9230,$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.66,1322,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.98,5994,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.68,7221,$$
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.39,2842,$$
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.36,5404,$$
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.82,7196,$$
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.82,950,$
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.97,8139,$

In [140]:
df["total_bill"].apply(lambda x: "$" if x < 20 else "$$" if x < 40 else "$$$") # We can do it in the one line

0       $
1       $
2      $$
3      $$
4      $$
       ..
239    $$
240    $$
241    $$
242     $
243     $
Name: total_bill, Length: 244, dtype: object

In [141]:
df2 = df[df["Pricy"].isin(["$$","$"])]
merged = df.merge(df2, how="left", indicator=True)
result = merged[merged["_merge"] == "left_only"].drop(columns="_merge")

In [142]:
result

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage,last_four,Pricy
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,13.94,595,$$$
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628,11.77,8690,$$$
102,44.30,2.50,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240,5.64,6604,$$$
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621,12.14,6453,$$$
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518,10.38,3321,$$$
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,19.68,8236,$$$
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337,7.72,9910,$$$
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140,7.40,4029,$$$
197,43.11,5.00,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313,11.60,175,$$$
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,18.62,5212,$$$

In [143]:
df["total_bill"].apply(lambda x : x * 2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [144]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage,last_four,Pricy
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.94,3410,$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.05,9230,$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.66,1322,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.98,5994,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.68,7221,$$

In [145]:
def quality(total_bill, tip):
    if tip / total_bill > 0.25:
        return "generous"
    else:
        return "other"

In [146]:
%timeit df["tip_type"] = df[["total_bill", "tip"]].apply(lambda df: quality(df["total_bill"], df["tip"]), axis=1)

1.66 ms ± 258 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [147]:
df[(df["tip_type"] == "generous") & (df["Pricy"] == "$")]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage,last_four,Pricy,tip_type
51,10.29,2.60,Female,No,Sun,Dinner,2,5.14,Jessica Ibarra,4999759463713,Sun4474,25.27,3713,$,generous
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,32.57,5267,$,generous
93,16.32,4.30,Female,Yes,Fri,Dinner,2,8.16,Natalie Nguyen,5181236182893396,Fri6963,26.35,3396,$,generous
109,14.31,4.00,Female,Yes,Sat,Dinner,2,7.16,Amanda Anderson,375638820334211,Sat2614,27.95,4211,$,generous
149,7.51,2.00,Male,No,Thur,Lunch,2,3.76,Daniel Robbins,4823139288341889,Thur6321,26.63,1889,$,generous
172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.62,Larry White,30432617123103,Sun9209,71.03,3103,$,generous
178,9.60,4.00,Female,Yes,Sun,Dinner,2,4.80,Melanie Gray,4211808859168,Sun4598,41.67,9168,$,generous
221,13.42,3.48,Female,Yes,Fri,Lunch,2,6.71,Leslie Kaufman,379437981958785,Fri7511,25.93,8785,$,generous
232,11.61,3.39,Male,No,Sat,Dinner,2,5.80,James Taylor,6011482917327995,Sat2124,29.20,7995,$,generous

In [148]:
%timeit df["quality"] = np.vectorize(quality)(df["total_bill"], df["tip"])

218 μs ± 75.5 μs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [149]:
%timeit df["quality"]

693 ns ± 45.1 ns per loop (mean ± std. dev. of 7 runs, 1,000,000 loops each)

In [150]:
df = pd.read_csv("examples/test.csv")

In [151]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.358352
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.822232
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441

In [152]:
df.describe()

,total_bill,tip,size,price_per_person,CC Number,Tip Persentage
count,244.000000,244.000000,244.000000,244.000000,2.440000e+02,244.000000
mean,19.785943,2.998279,2.569672,7.888197,2.563496e+15,16.080258
std,8.902412,1.383638,0.951100,2.914234,2.369340e+15,6.107220
min,3.070000,1.000000,1.000000,2.880000,6.040679e+10,3.563814
25%,13.347500,2.000000,2.000000,5.800000,3.040731e+13,12.912736
50%,17.795000,2.900000,2.000000,7.255000,3.525318e+15,15.476977
75%,24.127500,3.562500,3.000000,9.390000,4.553675e+15,19.147549
max,50.810000,10.000000,6.000000,20.270000,6.596454e+15,71.034483

In [153]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
 11  Tip Persentage    244 non-null    float64
dtypes: float64(4), int64(2), object(6)
memory usage: 23.0+ KB

In [154]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15
Tip Persentage,244.0,1.608026e+01,6.107220e+00,3.563814e+00,1.291274e+01,1.547698e+01,1.914755e+01,7.103448e+01

In [155]:
df.sort_values("tip")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,32.573290
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,7.936508
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,17.391304
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801,13.793103
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
...,...,...,...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,19.533528
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,13.942407
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,19.228818
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,18.621974
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,19.681165

In [156]:
df.sort_values("tip", ascending=False)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,19.681165
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,18.621974
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,19.228818
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,13.942407
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,19.533528
...,...,...,...,...,...,...,...,...,...,...,...,...
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,7.936508
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801,13.793103
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,32.573290
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,17.391304

In [157]:
df.sort_values(["tip","size"])

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,32.573290
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801,13.793103
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,17.391304
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,7.936508
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
...,...,...,...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,19.533528
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,13.942407
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,19.228818
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,18.621974
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,19.681165

In [158]:
df["total_bill"].max()

50.81

In [159]:
%timeit (list(df["total_bill"])).index(max(list(df["total_bill"])))

23.8 μs ± 4.41 μs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [160]:
%timeit df["total_bill"].idxmax()

5.89 μs ± 367 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [161]:
df.iloc[df["total_bill"].idxmin()]

total_bill                      3.07
tip                              1.0
sex                           Female
smoker                           Yes
day                              Sat
time                          Dinner
size                               1
price_per_person                3.07
Payer Name             Tiffany Brock
CC Number           4359488526995267
Payment ID                   Sat3455
Tip Persentage              32.57329
Name: 67, dtype: object

In [162]:
df[["total_bill", "tip", "size", "price_per_person"]].corr()

                  total_bill       tip      size  price_per_person
total_bill          1.000000  0.675734  0.598315          0.647554
tip                 0.675734  1.000000  0.489299          0.347405
size                0.598315  0.489299  1.000000         -0.175359
price_per_person    0.647554  0.347405 -0.175359          1.000000

In [163]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [164]:
df["sex"].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [165]:
df["day"].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [166]:
df["day"].nunique()

4

In [167]:
df["day"].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [168]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [169]:
df["sex"] = df["sex"].replace(["Female", "Male"], ["F", "M"])

In [170]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,F,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,M,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,M,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,M,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,F,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,M,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697
240,27.18,2.00,F,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,7.358352
241,22.67,2.00,M,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,8.822232
242,17.82,1.75,M,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426
243,18.78,3.00,F,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441

In [171]:
df["sex"] = df["sex"].replace( ["F", "M"], ["Female", "Male"])

In [172]:
myMap = {"Female":"F", "Male": "M"}

In [173]:
df["sex"].map(myMap)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [174]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [175]:
df.duplicated().unique()

array([False])

In [176]:
simple_df = pd.DataFrame([1,2,2], index=list("abc"))

In [177]:
simple_df

   0
a  1
b  2
c  2

In [178]:
simple_df.duplicated()
simple_df[simple_df.duplicated].index

Index(['c'], dtype='object')

In [179]:
simple_df.drop(simple_df[simple_df.duplicated].index, axis=0)

   0
a  1
b  2

In [180]:
simple_df

   0
a  1
b  2
c  2

In [181]:
simple_df.drop_duplicates()

   0
a  1
b  2

In [182]:
df[(df["total_bill"] > 10) & (df["total_bill"] < 20)]["total_bill"]

0      16.99
1      10.34
8      15.04
9      14.78
10     10.27
       ...
234    15.53
235    10.07
236    12.60
242    17.82
243    18.78
Name: total_bill, Length: 130, dtype: float64

In [183]:
df[df["total_bill"].between(10, 20)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,13.031915
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,21.853857
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546,16.650438
...,...,...,...,...,...,...,...,...,...,...,...,...
234,15.53,3.00,Male,Yes,Sat,Dinner,2,7.76,Tracy Douglas,4097938155941930,Sat7220,19.317450
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615,12.413108
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,7.936508
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,9.820426
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,15.974441

In [184]:
df.nlargest(10, "tip")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,19.681165
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,18.621974
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,19.228818
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,13.942407
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,19.533528
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059,28.053517
214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.39,Marissa Jackson,4922302538691962,Sat3374,23.074192
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,18.518519
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,20.392697
88,24.71,5.85,Male,No,Thur,Lunch,2,12.36,Roger Taylor,4410248629955,Thur9003,23.674626

In [185]:
df.sort_values("tip", ascending=False).iloc[0:2]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
170,50.81,10.0,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,19.681165
212,48.33,9.0,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,18.621974

In [186]:
df.sample(5)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
169,10.63,2.00,Female,Yes,Sat,Dinner,2,5.32,Amy Hill,3536332481454019,Sat1788,18.814675
161,12.66,2.50,Male,No,Sun,Dinner,2,6.33,Brandon Oconnor,4406882156920533,Sun5879,19.747235
69,15.01,2.09,Male,Yes,Sat,Dinner,2,7.50,Adam Hall,4700924377057571,Sat855,13.924051
222,8.58,1.92,Male,Yes,Fri,Lunch,1,8.58,Jason Lawrence,3505302934650403,Fri6624,22.377622
93,16.32,4.30,Female,Yes,Fri,Dinner,2,8.16,Natalie Nguyen,5181236182893396,Fri6963,26.348039

In [187]:
df.iloc[np.random.randint(0, 243, 5)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Tip Persentage
120,11.69,2.31,Male,No,Thur,Lunch,2,5.84,Kenneth Goodman,4891259691010,Thur8289,19.760479
25,17.81,2.34,Male,No,Sat,Dinner,4,4.45,Robert Perkins,30502930499388,Sat907,13.138686
206,26.59,3.41,Male,Yes,Sat,Dinner,3,8.86,Daniel Owens,38971087967574,Sat1,12.824370
220,12.16,2.20,Male,Yes,Fri,Lunch,2,6.08,Ricky Johnson,213109508670736,Fri4607,18.092105
74,14.73,2.20,Female,No,Sat,Dinner,2,7.36,Ashley Harris,501828723483,Sat6548,14.935506

In [188]:
df["time"].unique()

array(['Dinner', 'Lunch'], dtype=object)

### Options for missing data
- `dropna()`: Remove missing values.
- `fillna()`: Fill missing values with a specified value or method.
- `isna()`: Detect missing values.

In [189]:
np.nan

nan

In [190]:
pd.NA

In [191]:
pd.NaT

NaT

In [192]:
np.nan == np.nan

False

In [193]:
np.nan is np.nan

True

In [194]:
myvar = np.nan

In [195]:
myvar is np.nan

True

In [196]:
df = pd.read_csv("examples/movies.csv")

In [197]:
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [198]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [199]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [200]:
df[df["pre_movie_score"].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [201]:
df[(df["pre_movie_score"].isnull()) & (df["sex"].notnull())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [202]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [203]:
#Keep the data
#Drop the data
#Fill the data

In [204]:
#Drop the data
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(*, axis: 'Axis' = 0, how: 'AnyAll | lib.NoDefault' = <no_default>, thresh: 'int | lib.NoDefault' = <no_default>, subset: 'IndexLabel | None' = None, inplace: 'bool' = False, ignore_index: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values. Cannot be combined with how.
    subset : column label or sequence of labels, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    ignore_index : bool, default ``False``
        If ``True``, the resulting axis will be labeled 0, 1, …, n - 1.

        .. versionadded:: 2.0.0

    Returns
    -------
    DataFrame or None
        DataFrame with NA entries dropped from it or None if ``inplace=True``.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'toy'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

In [205]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [206]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [207]:
df.dropna(thresh=4)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [208]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [209]:
df.dropna(axis=1) # If column has any null values drop the column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [210]:
df.dropna(axis=0, thresh=1) # If row has any null value drop the row

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [211]:
df.dropna(axis=1, thresh=3)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [212]:
df.dropna(subset=["last_name", "pre_movie_score"])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [213]:
df.fillna('New Values').dropna() # Since there is no null value

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63.0,m,8.0,10.0
1,New Values,New Values,New Values,New Values,New Values,New Values
2,Hugh,Jackman,51.0,m,New Values,New Values
3,Oprah,Winfrey,66.0,f,6.0,8.0
4,Emma,Stone,31.0,f,7.0,9.0

In [214]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [215]:
df.pre_movie_score.index

RangeIndex(start=0, stop=5, step=1)

In [216]:
df["pre_movie_score"]

0    8.0
1    NaN
2    NaN
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [217]:
df = pd.read_csv("examples/movies.csv")

In [218]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [219]:
df["pre_movie_score"].fillna(df[df["pre_movie_score"].notnull()]["pre_movie_score"].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [220]:
df["pre_movie_score"].mean()

7.0

In [221]:
df["pre_movie_score"].fillna(df["pre_movie_score"].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [222]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [223]:
ser = pd.Series(airline_tix)

In [224]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

### Group by Operations
- `groupby()`: Group data based on one or more columns.
- `agg()`: Apply aggregation functions to grouped data.
- `transform()`: Apply functions to each group and return a DataFrame with the same shape as the original.
- `filter()`: Filter groups based on a condition.

In [225]:
df = pd.read_csv("examples/mpg.csv")

In [226]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [227]:
df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')

In [228]:
df["model_year"].unique() # Can be a catagorical column

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])

In [229]:
df["cylinders"].unique()

array([8, 4, 6, 3, 5])

In [230]:
df.groupby("model_year").mean(numeric_only=True)

,mpg,cylinders,displacement,weight,acceleration,origin
model_year,,,,,,
70,17.689655,6.758621,281.413793,3372.793103,12.948276,1.310345
71,21.250000,5.571429,209.750000,2995.428571,15.142857,1.428571
72,18.714286,5.821429,218.375000,3237.714286,15.125000,1.535714
73,17.100000,6.375000,256.875000,3419.025000,14.312500,1.375000
74,22.703704,5.259259,171.740741,2877.925926,16.203704,1.666667
75,20.266667,5.600000,205.533333,3176.800000,16.050000,1.466667
76,21.573529,5.647059,197.794118,3078.735294,15.941176,1.470588
77,23.375000,5.464286,191.392857,2997.357143,15.435714,1.571429
78,24.061111,5.361111,177.805556,2861.805556,15.805556,1.611111
79,25.093103,5.827586,206.689655,3055.344828,15.813793,1.275862
80,33.696552,4.137931,115.827586,2436.655172,16.934483,2.206897
81,30.334483,4.620690,135.310345,2522.931034,16.306897,1.965517
82,31.709677,4.193548,128.870968,2453.548387,16.638710,1.645161

In [231]:
avg_year = df.groupby("model_year").mean(numeric_only=True)

In [232]:
avg_year.index

Index([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], dtype='int64', name='model_year')

In [233]:
avg_year.columns

Index(['mpg', 'cylinders', 'displacement', 'weight', 'acceleration', 'origin'], dtype='object')

In [234]:
type(avg_year)

pandas.core.frame.DataFrame

In [235]:
avg_year.describe()

,mpg,cylinders,displacement,weight,acceleration,origin
count,13.000000,13.000000,13.000000,13.000000,13.000000,13.000000
mean,23.659059,5.433688,192.106073,2960.466485,15.589128,1.579195
std,5.308042,0.761233,47.662157,325.173903,1.051988,0.260025
min,17.100000,4.137931,115.827586,2436.655172,12.948276,1.275862
25%,20.266667,5.259259,171.740741,2861.805556,15.142857,1.428571
50%,22.703704,5.571429,197.794118,2997.357143,15.813793,1.535714
75%,25.093103,5.821429,209.750000,3176.800000,16.203704,1.645161
max,33.696552,6.758621,281.413793,3419.025000,16.934483,2.206897

In [236]:
avg_year["mpg"].mean()

23.659059010025768

In [237]:
avg_year["Consumption"] = avg_year["mpg"].apply(lambda x: "Low" if x < 18 else "medium" if x < 25 else "High")

In [238]:
avg_year

,mpg,cylinders,displacement,weight,acceleration,origin,Consumption
model_year,,,,,,,
70,17.689655,6.758621,281.413793,3372.793103,12.948276,1.310345,Low
71,21.250000,5.571429,209.750000,2995.428571,15.142857,1.428571,medium
72,18.714286,5.821429,218.375000,3237.714286,15.125000,1.535714,medium
73,17.100000,6.375000,256.875000,3419.025000,14.312500,1.375000,Low
74,22.703704,5.259259,171.740741,2877.925926,16.203704,1.666667,medium
75,20.266667,5.600000,205.533333,3176.800000,16.050000,1.466667,medium
76,21.573529,5.647059,197.794118,3078.735294,15.941176,1.470588,medium
77,23.375000,5.464286,191.392857,2997.357143,15.435714,1.571429,medium
78,24.061111,5.361111,177.805556,2861.805556,15.805556,1.611111,medium
79,25.093103,5.827586,206.689655,3055.344828,15.813793,1.275862,High
80,33.696552,4.137931,115.827586,2436.655172,16.934483,2.206897,High
81,30.334483,4.620690,135.310345,2522.931034,16.306897,1.965517,High
82,31.709677,4.193548,128.870968,2453.548387,16.638710,1.645161,High

In [239]:
df.groupby(["model_year", "cylinders"]).mean(numeric_only=True)[["mpg", "origin"]]

                            mpg    origin
model_year cylinders
70         4          25.285714  2.285714
           6          20.500000  1.000000
           8          14.111111  1.000000
71         4          27.461538  1.923077
           6          18.000000  1.000000
           8          13.428571  1.000000
72         3          19.000000  3.000000
           4          23.428571  1.928571
           8          13.615385  1.000000
73         3          18.000000  3.000000
           4          22.727273  2.000000
           6          19.000000  1.250000
           8          13.200000  1.000000
74         4          27.800000  2.200000
           6          17.857143  1.000000
           8          14.200000  1.000000
75         4          25.250000  2.166667
           6          17.583333  1.000000
           8          15.666667  1.000000
76         4          26.766667  1.866667
           6          20.000000  1.300000
           8          14.666667  1.000000
77         3          21.500000  3.000000
           4          29.107143  1.857143
           6          19.500000  1.400000
           8          16.000000  1.000000
78         4          29.576471  2.117647
           5          20.300000  2.000000
           6          19.066667  1.166667
           8          19.050000  1.000000
79         4          31.525000  1.583333
           5          25.400000  2.000000
           6          22.950000  1.000000
           8          18.630000  1.000000
80         3          23.700000  3.000000
           4          34.612000  2.200000
           5          36.400000  2.000000
           6          25.900000  2.000000
81         4          32.814286  2.095238
           6          23.428571  1.714286
           8          26.600000  1.000000
82         4          32.071429  1.714286
           6          28.333333  1.000000

In [240]:
df.groupby("model_year").describe().T

model_year                   70           71           72           73  \
mpg          count    29.000000    28.000000    28.000000    40.000000
             mean     17.689655    21.250000    18.714286    17.100000
             std       5.339231     6.591942     5.435529     4.700245
             min       9.000000    12.000000    11.000000    11.000000
             25%      14.000000    15.500000    13.750000    13.000000
             50%      16.000000    19.000000    18.500000    16.000000
             75%      22.000000    27.000000    23.000000    20.000000
             max      27.000000    35.000000    28.000000    29.000000
cylinders    count    29.000000    28.000000    28.000000    40.000000
             mean      6.758621     5.571429     5.821429     6.375000
             std       1.724926     1.665079     2.073708     1.807215
             min       4.000000     4.000000     3.000000     3.000000
             25%       6.000000     4.000000     4.000000     4.000000
             50%       8.000000     6.000000     4.000000     7.000000
             75%       8.000000     6.500000     8.000000     8.000000
             max       8.000000     8.000000     8.000000     8.000000
displacement count    29.000000    28.000000    28.000000    40.000000
             mean    281.413793   209.750000   218.375000   256.875000
             std     124.421380   115.102410   123.781964   121.722085
             min      97.000000    71.000000    70.000000    68.000000
             25%     198.000000    97.750000   109.250000   121.750000
             50%     307.000000   228.500000   131.000000   276.000000
             75%     383.000000   273.000000   326.000000   350.250000
             max     455.000000   400.000000   429.000000   455.000000
weight       count    29.000000    28.000000    28.000000    40.000000
             mean   3372.793103  2995.428571  3237.714286  3419.025000
             std     852.868663  1061.830859   974.520960   974.809133
             min    1835.000000  1613.000000  2100.000000  1867.000000
             25%    2648.000000  2110.750000  2285.500000  2554.500000
             50%    3449.000000  2798.000000  2956.000000  3338.500000
             75%    4312.000000  3603.250000  4169.750000  4247.250000
             max    4732.000000  5140.000000  4633.000000  4997.000000
acceleration count    29.000000    28.000000    28.000000    40.000000
             mean     12.948276    15.142857    15.125000    14.312500
             std       3.330982     2.666171     2.850032     2.754222
             min       8.000000    11.500000    11.000000     9.500000
             25%      10.000000    13.375000    13.375000    12.500000
             50%      12.500000    14.500000    14.500000    14.000000
             75%      15.000000    16.125000    16.625000    16.000000
             max      20.500000    20.500000    23.500000    21.000000
origin       count    29.000000    28.000000    28.000000    40.000000
             mean      1.310345     1.428571     1.535714     1.375000
             std       0.603765     0.741798     0.792658     0.667467
             min       1.000000     1.000000     1.000000     1.000000
             25%       1.000000     1.000000     1.000000     1.000000
             50%       1.000000     1.000000     1.000000     1.000000
             75%       1.000000     2.000000     2.000000     2.000000
             max       3.000000     3.000000     3.000000     3.000000

model_year                   74           75           76           77  \
mpg          count    27.000000    30.000000    34.000000    28.000000
             mean     22.703704    20.266667    21.573529    23.375000
             std       6.420010     4.940566     5.889297     6.675862
             min      13.000000    13.000000    13.000000    15.000000
             25%      16.000000    16.000000    16.750000    17.375000
             50%      24.000000    19.500000    21.000000    21.750000
             75%      27.000000    23.000000    26.375000    30.000000
             max      32.000000    33.000000    33.000000    36.000000
cylinders    count    27.000000    30.000000    34.000000    28.000000
             mean      5.259259     5.600000     5.647059     5.464286
             std       1.583390     1.522249     1.667558     1.815206
             min       4.000000     4.000000     4.000000     3.000000
             25%       4.000000     4.000000     4.000000     4.000000
             50%       4.000000     6.000000     6.000000     4.000000
             75%       6.000000     6.000000     7.500000     8.000000
             max       8.000000     8.000000     8.000000     8.000000
displacement count    27.000000    30.000000    34.000000    28.000000
             mean    171.740741   205.533333   197.794118   191.392857
             std      92.601127    87.669730    94.422256   107.813742
             min      71.000000    90.000000    85.000000    79.000000
             25%      90.000000   121.000000   102.500000    97.750000
             50%     122.000000   228.000000   184.000000   143.000000
             75%     250.000000   250.000000   291.000000   270.500000
             max     350.000000   400.000000   351.000000   400.000000
weight       count    27.000000    30.000000    34.000000    28.000000
             mean   2877.925926  3176.800000  3078.735294  2997.357143
             std     949.308571   765.179781   821.371481   912.825902
             min    1649.000000  1795.000000  1795.000000  1825.000000
             25%    2116.500000  2676.750000  2228.750000  2135.000000
             50%    2489.000000  3098.500000  3171.500000  2747.500000
             75%    3622.500000  3662.250000  3803.750000  3925.000000
             max    4699.000000  4668.000000  4380.000000  4335.000000
acceleration count    27.000000    30.000000    34.000000    28.000000
             mean     16.203704    16.050000    15.941176    15.435714
             std       1.688532     2.471737     2.801419     2.273391
             min      13.500000    11.500000    12.000000    11.100000
             25%      15.250000    14.125000    13.925000    14.000000
             50%      16.000000    16.000000    15.500000    15.650000
             75%      17.000000    17.375000    17.550000    16.925000
             max      21.000000    21.000000    22.200000    19.000000
origin       count    27.000000    30.000000    34.000000    28.000000
             mean      1.666667     1.466667     1.470588     1.571429
             std       0.832050     0.730297     0.706476     0.835711
             min       1.000000     1.000000     1.000000     1.000000
             25%       1.000000     1.000000     1.000000     1.000000
             50%       1.000000     1.000000     1.000000     1.000000
             75%       2.000000     2.000000     2.000000     2.000000
             max       3.000000     3.000000     3.000000     3.000000

model_year                   78           79           80           81  \
mpg          count    36.000000    29.000000    29.000000    29.000000
             mean     24.061111    25.093103    33.696552    30.334483
             std       6.898044     6.794217     7.037983     5.591465
             min      16.200000    15.500000    19.100000    17.600000
             25%      19.350000    19.200000    29.800000    26.600000
             50%      20.700000    23.900000    32.700000    31.600000
             75%      28.000000    31.800000    38.100000    34.400000
             max      43.100000    37.300000    46.600000    39.100000
cylinders    count    36.000000    29.000000    29.000000    29.000000
             mean      5.361111     5.827586     4.137931     4.620690
             std       1.495761     1.774199     0.580895     1.082781
             min       4.000000     4.000000     3.000000     4.000000
             25%       4.000000     4.000000     4.000000     4.000000
             50%       5.500000     6.000000     4.000000     4.000000
             75%       6.000000     8.000000     4.000000     6.000000
             max       8.000000     8.000000     6.000000     8.000000
displacement count    36.000000    29.000000    29.000000    29.000000
             mean    177.805556   206.689655   115.827586   135.310345
             std      76.012713    96.307581    33.744914    58.387929
             min      78.000000    85.000000    70.000000    79.000000
             25%     115.500000   121.000000    90.000000    98.000000
             50%     159.500000   183.000000   107.000000   119.000000
             75%     231.000000   302.000000   140.000000   151.000000
             max     318.000000   360.000000   225.000000   350.000000
weight       count    36.000000    29.000000    29.000000    29.000000
             mean   2861.805556  3055.344828  2436.655172  2522.931034
             std     626.023907   747.881497   432.235491   533.600501
             min    1800.000000  1915.000000  1835.000000  1755.000000
             25%    2282.500000  2556.000000  2110.000000  2065.000000
             50%    2910.000000  3190.000000  2335.000000  2385.000000
             75%    3410.000000  3725.000000  2800.000000  2900.000000
             max    4080.000000  4360.000000  3381.000000  3725.000000
acceleration count    36.000000    29.000000    29.000000    29.000000
             mean     15.805556    15.813793    16.934483    16.306897
             std       2.129915     2.952931     2.826694     2.192509
             min      11.200000    11.300000    11.400000    12.600000
             25%      14.475000    14.000000    15.100000    14.800000
             50%      15.750000    15.000000    16.500000    16.200000
             75%      16.825000    17.300000    18.700000    17.300000
             max      21.500000    24.800000    23.700000    20.700000
origin       count    36.000000    29.000000    29.000000    29.000000
             mean      1.611111     1.275862     2.206897     1.965517
             std       0.837608     0.591400     0.818505     0.944259
             min       1.000000     1.000000     1.000000     1.000000
             25%       1.000000     1.000000     2.000000     1.000000
             50%       1.000000     1.000000     2.000000     2.000000
             75%       2.000000     1.000000     3.000000     3.000000
             max       3.000000     3.000000     3.000000     3.000000

model_year                   82
mpg          count    31.000000
             mean     31.709677
             std       5.392548
             min      22.000000
             25%      27.000000
             50%      32.000000
             75%      36.000000
             max      44.000000
cylinders    count    31.000000
             mean      4.193548
             std       0.601074
             min       4.000000
             25%       4.000000
             50%       4.000000
             75%       4.000000
             max       6.000000
displacement count    31.000000
             mean    128.870968
             std      39.352037
             min      91.000000
             25%     105.000000
             50%     119.000000
             75%     142.000000
             max     262.000000
weight       count    31.000000
             mean   2453.548387
             std     354.276713
             min    1965.000000
             25%    2127.500000
             50%    2525.000000
             75%    2727.500000
             max    3035.000000
acceleration count    31.000000
             mean     16.638710
             std       2.484844
             min      11.600000
             25%      14.850000
             50%      16.400000
             75%      18.000000
             max      24.600000
origin       count    31.000000
             mean      1.645161
             std       0.914636
             min       1.000000
             25%       1.000000
             50%       1.000000
             75%       3.000000
             max       3.000000

In [241]:
year_cyl = df.groupby(["model_year", "cylinders"]).mean("mpg")

In [242]:
year_cyl

                            mpg  displacement       weight  acceleration  \
model_year cylinders
70         4          25.285714    107.000000  2292.571429     16.000000
           6          20.500000    199.000000  2710.500000     15.500000
           8          14.111111    367.555556  3940.055556     11.194444
71         4          27.461538    101.846154  2056.384615     16.961538
           6          18.000000    243.375000  3171.875000     14.750000
           8          13.428571    371.714286  4537.714286     12.214286
72         3          19.000000     70.000000  2330.000000     13.500000
           4          23.428571    111.535714  2382.642857     17.214286
           8          13.615385    344.846154  4228.384615     13.000000
73         3          18.000000     70.000000  2124.000000     13.500000
           4          22.727273    109.272727  2338.090909     17.136364
           6          19.000000    212.250000  2917.125000     15.687500
           8          13.200000    365.250000  4279.050000     12.250000
74         4          27.800000     96.533333  2151.466667     16.400000
           6          17.857143    230.428571  3320.000000     16.857143
           8          14.200000    315.200000  4438.400000     14.700000
75         4          25.250000    114.833333  2489.250000     15.833333
           6          17.583333    233.750000  3398.333333     17.708333
           8          15.666667    330.500000  4108.833333     13.166667
76         4          26.766667    106.333333  2306.600000     16.866667
           6          20.000000    221.400000  3349.600000     17.000000
           8          14.666667    324.000000  4064.666667     13.222222
77         3          21.500000     80.000000  2720.000000     13.500000
           4          29.107143    106.500000  2205.071429     16.064286
           6          19.500000    220.400000  3383.000000     16.900000
           8          16.000000    335.750000  4177.500000     13.662500
78         4          29.576471    112.117647  2296.764706     16.282353
           5          20.300000    131.000000  2830.000000     15.900000
           6          19.066667    213.250000  3314.166667     16.391667
           8          19.050000    300.833333  3563.333333     13.266667
79         4          31.525000    113.583333  2357.583333     15.991667
           5          25.400000    183.000000  3530.000000     20.100000
           6          22.950000    205.666667  3025.833333     15.433333
           8          18.630000    321.400000  3862.900000     15.400000
80         3          23.700000     70.000000  2420.000000     12.500000
           4          34.612000    111.000000  2360.080000     17.144000
           5          36.400000    121.000000  2950.000000     19.900000
           6          25.900000    196.500000  3145.500000     15.050000
81         4          32.814286    108.857143  2275.476190     16.466667
           6          23.428571    184.000000  3093.571429     15.442857
           8          26.600000    350.000000  3725.000000     19.000000
82         4          32.071429    118.571429  2402.321429     16.703571
           6          28.333333    225.000000  2931.666667     16.033333

                        origin
model_year cylinders
70         4          2.285714
           6          1.000000
           8          1.000000
71         4          1.923077
           6          1.000000
           8          1.000000
72         3          3.000000
           4          1.928571
           8          1.000000
73         3          3.000000
           4          2.000000
           6          1.250000
           8          1.000000
74         4          2.200000
           6          1.000000
           8          1.000000
75         4          2.166667
           6          1.000000
           8          1.000000
76         4          1.866667
           6          1.300000
           8          1.000000
77         3          3.000000
           4          1.857143
           6          1.400000
           8          1.000000
78         4          2.117647
           5          2.000000
           6          1.166667
           8          1.000000
79         4          1.583333
           5          2.000000
           6          1.000000
           8          1.000000
80         3          3.000000
           4          2.200000
           5          2.000000
           6          2.000000
81         4          2.095238
           6          1.714286
           8          1.000000
82         4          1.714286
           6          1.000000

In [243]:
year_cyl.index.names

FrozenList(['model_year', 'cylinders'])

In [244]:
year_cyl.index.levels

FrozenList([[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], [3, 4, 5, 6, 8]])

In [245]:
year_cyl.loc[70].iloc[1]

mpg               20.5
displacement     199.0
weight          2710.5
acceleration      15.5
origin             1.0
Name: 6, dtype: float64

In [246]:
year_cyl.loc[(70,4)]

mpg               25.285714
displacement     107.000000
weight          2292.571429
acceleration      16.000000
origin             2.285714
Name: (70, 4), dtype: float64

In [247]:
year_cyl.xs(key=70, level="model_year")

                 mpg  displacement       weight  acceleration    origin
cylinders
4          25.285714    107.000000  2292.571429     16.000000  2.285714
6          20.500000    199.000000  2710.500000     15.500000  1.000000
8          14.111111    367.555556  3940.055556     11.194444  1.000000

In [248]:
year_cyl.loc[[70, 80]]

                            mpg  displacement       weight  acceleration  \
model_year cylinders
70         4          25.285714    107.000000  2292.571429     16.000000
           6          20.500000    199.000000  2710.500000     15.500000
           8          14.111111    367.555556  3940.055556     11.194444
80         3          23.700000     70.000000  2420.000000     12.500000
           4          34.612000    111.000000  2360.080000     17.144000
           5          36.400000    121.000000  2950.000000     19.900000
           6          25.900000    196.500000  3145.500000     15.050000

                        origin
model_year cylinders
70         4          2.285714
           6          1.000000
           8          1.000000
80         3          3.000000
           4          2.200000
           5          2.000000
           6          2.000000

In [249]:
year_cyl.xs(key=6, level="cylinders")

                  mpg  displacement       weight  acceleration    origin
model_year
70          20.500000    199.000000  2710.500000     15.500000  1.000000
71          18.000000    243.375000  3171.875000     14.750000  1.000000
73          19.000000    212.250000  2917.125000     15.687500  1.250000
74          17.857143    230.428571  3320.000000     16.857143  1.000000
75          17.583333    233.750000  3398.333333     17.708333  1.000000
76          20.000000    221.400000  3349.600000     17.000000  1.300000
77          19.500000    220.400000  3383.000000     16.900000  1.400000
78          19.066667    213.250000  3314.166667     16.391667  1.166667
79          22.950000    205.666667  3025.833333     15.433333  1.000000
80          25.900000    196.500000  3145.500000     15.050000  2.000000
81          23.428571    184.000000  3093.571429     15.442857  1.714286
82          28.333333    225.000000  2931.666667     16.033333  1.000000

In [250]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [251]:
df[df["cylinders"].isin([6, 8])].groupby(["model_year", "cylinders"]).mean(numeric_only=True)

                            mpg  displacement       weight  acceleration  \
model_year cylinders
70         6          20.500000    199.000000  2710.500000     15.500000
           8          14.111111    367.555556  3940.055556     11.194444
71         6          18.000000    243.375000  3171.875000     14.750000
           8          13.428571    371.714286  4537.714286     12.214286
72         8          13.615385    344.846154  4228.384615     13.000000
73         6          19.000000    212.250000  2917.125000     15.687500
           8          13.200000    365.250000  4279.050000     12.250000
74         6          17.857143    230.428571  3320.000000     16.857143
           8          14.200000    315.200000  4438.400000     14.700000
75         6          17.583333    233.750000  3398.333333     17.708333
           8          15.666667    330.500000  4108.833333     13.166667
76         6          20.000000    221.400000  3349.600000     17.000000
           8          14.666667    324.000000  4064.666667     13.222222
77         6          19.500000    220.400000  3383.000000     16.900000
           8          16.000000    335.750000  4177.500000     13.662500
78         6          19.066667    213.250000  3314.166667     16.391667
           8          19.050000    300.833333  3563.333333     13.266667
79         6          22.950000    205.666667  3025.833333     15.433333
           8          18.630000    321.400000  3862.900000     15.400000
80         6          25.900000    196.500000  3145.500000     15.050000
81         6          23.428571    184.000000  3093.571429     15.442857
           8          26.600000    350.000000  3725.000000     19.000000
82         6          28.333333    225.000000  2931.666667     16.033333

                        origin
model_year cylinders
70         6          1.000000
           8          1.000000
71         6          1.000000
           8          1.000000
72         8          1.000000
73         6          1.250000
           8          1.000000
74         6          1.000000
           8          1.000000
75         6          1.000000
           8          1.000000
76         6          1.300000
           8          1.000000
77         6          1.400000
           8          1.000000
78         6          1.166667
           8          1.000000
79         6          1.000000
           8          1.000000
80         6          2.000000
81         6          1.714286
           8          1.000000
82         6          1.000000

In [252]:
df.groupby(["model_year", "cylinders"]).mean(numeric_only=True).loc[(70,6)]

mpg               20.5
displacement     199.0
weight          2710.5
acceleration      15.5
origin             1.0
Name: (70, 6), dtype: float64

In [253]:
year_cyl.index.levels

FrozenList([[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], [3, 4, 5, 6, 8]])

In [254]:
year_cyl.loc[[(70, 4), (70,8)]]

                            mpg  displacement       weight  acceleration  \
model_year cylinders
70         4          25.285714    107.000000  2292.571429     16.000000
           8          14.111111    367.555556  3940.055556     11.194444

                        origin
model_year cylinders
70         4          2.285714
           8          1.000000

In [255]:
year_cyl.xs(80) # It can be done with loc

              mpg  displacement   weight  acceleration  origin
cylinders
3          23.700          70.0  2420.00        12.500     3.0
4          34.612         111.0  2360.08        17.144     2.2
5          36.400         121.0  2950.00        19.900     2.0
6          25.900         196.5  3145.50        15.050     2.0

In [256]:
# year_cyl.xs([70, 80]) -> It didn't take a list as an argument

In [257]:
year_cyl.xs(key = 4, level="cylinders")

                  mpg  displacement       weight  acceleration    origin
model_year
70          25.285714    107.000000  2292.571429     16.000000  2.285714
71          27.461538    101.846154  2056.384615     16.961538  1.923077
72          23.428571    111.535714  2382.642857     17.214286  1.928571
73          22.727273    109.272727  2338.090909     17.136364  2.000000
74          27.800000     96.533333  2151.466667     16.400000  2.200000
75          25.250000    114.833333  2489.250000     15.833333  2.166667
76          26.766667    106.333333  2306.600000     16.866667  1.866667
77          29.107143    106.500000  2205.071429     16.064286  1.857143
78          29.576471    112.117647  2296.764706     16.282353  2.117647
79          31.525000    113.583333  2357.583333     15.991667  1.583333
80          34.612000    111.000000  2360.080000     17.144000  2.200000
81          32.814286    108.857143  2275.476190     16.466667  2.095238
82          32.071429    118.571429  2402.321429     16.703571  1.714286

In [258]:
four_cyl = year_cyl.xs(key=4, level="cylinders")

In [259]:
four_cyl

                  mpg  displacement       weight  acceleration    origin
model_year
70          25.285714    107.000000  2292.571429     16.000000  2.285714
71          27.461538    101.846154  2056.384615     16.961538  1.923077
72          23.428571    111.535714  2382.642857     17.214286  1.928571
73          22.727273    109.272727  2338.090909     17.136364  2.000000
74          27.800000     96.533333  2151.466667     16.400000  2.200000
75          25.250000    114.833333  2489.250000     15.833333  2.166667
76          26.766667    106.333333  2306.600000     16.866667  1.866667
77          29.107143    106.500000  2205.071429     16.064286  1.857143
78          29.576471    112.117647  2296.764706     16.282353  2.117647
79          31.525000    113.583333  2357.583333     15.991667  1.583333
80          34.612000    111.000000  2360.080000     17.144000  2.200000
81          32.814286    108.857143  2275.476190     16.466667  2.095238
82          32.071429    118.571429  2402.321429     16.703571  1.714286

In [260]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [261]:
new_df = df[df["cylinders"].isin([6,8])]

In [262]:
new_df = new_df.groupby(["model_year", "cylinders"]).mean(numeric_only=True)

In [263]:
new_df.xs(key=70, level="model_year")

                 mpg  displacement       weight  acceleration  origin
cylinders
6          20.500000    199.000000  2710.500000     15.500000     1.0
8          14.111111    367.555556  3940.055556     11.194444     1.0

In [264]:
new_df.loc[[x for x in range(70,81)]]

                            mpg  displacement       weight  acceleration  \
model_year cylinders
70         6          20.500000    199.000000  2710.500000     15.500000
           8          14.111111    367.555556  3940.055556     11.194444
71         6          18.000000    243.375000  3171.875000     14.750000
           8          13.428571    371.714286  4537.714286     12.214286
72         8          13.615385    344.846154  4228.384615     13.000000
73         6          19.000000    212.250000  2917.125000     15.687500
           8          13.200000    365.250000  4279.050000     12.250000
74         6          17.857143    230.428571  3320.000000     16.857143
           8          14.200000    315.200000  4438.400000     14.700000
75         6          17.583333    233.750000  3398.333333     17.708333
           8          15.666667    330.500000  4108.833333     13.166667
76         6          20.000000    221.400000  3349.600000     17.000000
           8          14.666667    324.000000  4064.666667     13.222222
77         6          19.500000    220.400000  3383.000000     16.900000
           8          16.000000    335.750000  4177.500000     13.662500
78         6          19.066667    213.250000  3314.166667     16.391667
           8          19.050000    300.833333  3563.333333     13.266667
79         6          22.950000    205.666667  3025.833333     15.433333
           8          18.630000    321.400000  3862.900000     15.400000
80         6          25.900000    196.500000  3145.500000     15.050000

                        origin
model_year cylinders
70         6          1.000000
           8          1.000000
71         6          1.000000
           8          1.000000
72         8          1.000000
73         6          1.250000
           8          1.000000
74         6          1.000000
           8          1.000000
75         6          1.000000
           8          1.000000
76         6          1.300000
           8          1.000000
77         6          1.400000
           8          1.000000
78         6          1.166667
           8          1.000000
79         6          1.000000
           8          1.000000
80         6          2.000000

In [265]:
year_cyl.swaplevel()

,,mpg,displacement,weight,acceleration,origin
cylinders,model_year,,,,,
4,70,25.285714,107.000000,2292.571429,16.000000,2.285714
6,70,20.500000,199.000000,2710.500000,15.500000,1.000000
8,70,14.111111,367.555556,3940.055556,11.194444,1.000000
4,71,27.461538,101.846154,2056.384615,16.961538,1.923077
6,71,18.000000,243.375000,3171.875000,14.750000,1.000000
8,71,13.428571,371.714286,4537.714286,12.214286,1.000000
3,72,19.000000,70.000000,2330.000000,13.500000,3.000000
4,72,23.428571,111.535714,2382.642857,17.214286,1.928571
8,72,13.615385,344.846154,4228.384615,13.000000,1.000000
3,73,18.000000,70.000000,2124.000000,13.500000,3.000000
4,73,22.727273,109.272727,2338.090909,17.136364,2.000000
6,73,19.000000,212.250000,2917.125000,15.687500,1.250000
8,73,13.200000,365.250000,4279.050000,12.250000,1.000000
4,74,27.800000,96.533333,2151.466667,16.400000,2.200000
6,74,17.857143,230.428571,3320.000000,16.857143,1.000000
8,74,14.200000,315.200000,4438.400000,14.700000,1.000000
4,75,25.250000,114.833333,2489.250000,15.833333,2.166667
6,75,17.583333,233.750000,3398.333333,17.708333,1.000000
8,75,15.666667,330.500000,4108.833333,13.166667,1.000000
4,76,26.766667,106.333333,2306.600000,16.866667,1.866667
6,76,20.000000,221.400000,3349.600000,17.000000,1.300000
8,76,14.666667,324.000000,4064.666667,13.222222,1.000000
3,77,21.500000,80.000000,2720.000000,13.500000,3.000000
4,77,29.107143,106.500000,2205.071429,16.064286,1.857143
6,77,19.500000,220.400000,3383.000000,16.900000,1.400000
8,77,16.000000,335.750000,4177.500000,13.662500,1.000000
4,78,29.576471,112.117647,2296.764706,16.282353,2.117647
5,78,20.300000,131.000000,2830.000000,15.900000,2.000000
6,78,19.066667,213.250000,3314.166667,16.391667,1.166667
8,78,19.050000,300.833333,3563.333333,13.266667,1.000000
4,79,31.525000,113.583333,2357.583333,15.991667,1.583333
5,79,25.400000,183.000000,3530.000000,20.100000,2.000000
6,79,22.950000,205.666667,3025.833333,15.433333,1.000000
8,79,18.630000,321.400000,3862.900000,15.400000,1.000000
3,80,23.700000,70.000000,2420.000000,12.500000,3.000000
4,80,34.612000,111.000000,2360.080000,17.144000,2.200000
5,80,36.400000,121.000000,2950.000000,19.900000,2.000000
6,80,25.900000,196.500000,3145.500000,15.050000,2.000000
4,81,32.814286,108.857143,2275.476190,16.466667,2.095238
6,81,23.428571,184.000000,3093.571429,15.442857,1.714286
8,81,26.600000,350.000000,3725.000000,19.000000,1.000000
4,82,32.071429,118.571429,2402.321429,16.703571,1.714286
6,82,28.333333,225.000000,2931.666667,16.033333,1.000000

In [266]:
year_cyl.sort_index(level="model_year", ascending=False)

                            mpg  displacement       weight  acceleration  \
model_year cylinders
82         6          28.333333    225.000000  2931.666667     16.033333
           4          32.071429    118.571429  2402.321429     16.703571
81         8          26.600000    350.000000  3725.000000     19.000000
           6          23.428571    184.000000  3093.571429     15.442857
           4          32.814286    108.857143  2275.476190     16.466667
80         6          25.900000    196.500000  3145.500000     15.050000
           5          36.400000    121.000000  2950.000000     19.900000
           4          34.612000    111.000000  2360.080000     17.144000
           3          23.700000     70.000000  2420.000000     12.500000
79         8          18.630000    321.400000  3862.900000     15.400000
           6          22.950000    205.666667  3025.833333     15.433333
           5          25.400000    183.000000  3530.000000     20.100000
           4          31.525000    113.583333  2357.583333     15.991667
78         8          19.050000    300.833333  3563.333333     13.266667
           6          19.066667    213.250000  3314.166667     16.391667
           5          20.300000    131.000000  2830.000000     15.900000
           4          29.576471    112.117647  2296.764706     16.282353
77         8          16.000000    335.750000  4177.500000     13.662500
           6          19.500000    220.400000  3383.000000     16.900000
           4          29.107143    106.500000  2205.071429     16.064286
           3          21.500000     80.000000  2720.000000     13.500000
76         8          14.666667    324.000000  4064.666667     13.222222
           6          20.000000    221.400000  3349.600000     17.000000
           4          26.766667    106.333333  2306.600000     16.866667
75         8          15.666667    330.500000  4108.833333     13.166667
           6          17.583333    233.750000  3398.333333     17.708333
           4          25.250000    114.833333  2489.250000     15.833333
74         8          14.200000    315.200000  4438.400000     14.700000
           6          17.857143    230.428571  3320.000000     16.857143
           4          27.800000     96.533333  2151.466667     16.400000
73         8          13.200000    365.250000  4279.050000     12.250000
           6          19.000000    212.250000  2917.125000     15.687500
           4          22.727273    109.272727  2338.090909     17.136364
           3          18.000000     70.000000  2124.000000     13.500000
72         8          13.615385    344.846154  4228.384615     13.000000
           4          23.428571    111.535714  2382.642857     17.214286
           3          19.000000     70.000000  2330.000000     13.500000
71         8          13.428571    371.714286  4537.714286     12.214286
           6          18.000000    243.375000  3171.875000     14.750000
           4          27.461538    101.846154  2056.384615     16.961538
70         8          14.111111    367.555556  3940.055556     11.194444
           6          20.500000    199.000000  2710.500000     15.500000
           4          25.285714    107.000000  2292.571429     16.000000

                        origin
model_year cylinders
82         6          1.000000
           4          1.714286
81         8          1.000000
           6          1.714286
           4          2.095238
80         6          2.000000
           5          2.000000
           4          2.200000
           3          3.000000
79         8          1.000000
           6          1.000000
           5          2.000000
           4          1.583333
78         8          1.000000
           6          1.166667
           5          2.000000
           4          2.117647
77         8          1.000000
           6          1.400000
           4          1.857143
           3          3.000000
76         8          1.000000
           6          1.300000
           4          1.866667
75         8          1.000000
           6          1.000000
           4          2.166667
74         8          1.000000
           6          1.000000
           4          2.200000
73         8          1.000000
           6          1.250000
           4          2.000000
           3          3.000000
72         8          1.000000
           4          1.928571
           3          3.000000
71         8          1.000000
           6          1.000000
           4          1.923077
70         8          1.000000
           6          1.000000
           4          2.285714

In [267]:
(df == "?").sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

In [268]:
df = df.replace("?", np.nan)

In [269]:
df = df.apply(pd.to_numeric, errors="ignore")

/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/3400095637.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead
  df = df.apply(pd.to_numeric, errors="ignore")

In [270]:
num_df = df.select_dtypes(include="number")

In [271]:
num_df.agg(["std", "mean"])

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864

In [272]:
df.agg({"mpg":["max", "mean"], "weight":["mean","std"]})

            mpg       weight
max   46.600000          NaN
mean  23.514573  2970.424623
std         NaN   846.841774

### Concatination and Merging

In [273]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [274]:
one = pd.DataFrame(data = data_one)

In [275]:
two = pd.DataFrame(data=data_two)

In [276]:
one.columns

Index(['A', 'B'], dtype='object')

In [277]:
two.columns

Index(['C', 'D'], dtype='object')

In [278]:
one.values

array([['A0', 'B0'],
       ['A1', 'B1'],
       ['A2', 'B2'],
       ['A3', 'B3']], dtype=object)

In [279]:
one.index = [x for x in range(1,5)]

In [280]:
one

    A   B
1  A0  B0
2  A1  B1
3  A2  B2
4  A3  B3

In [281]:
pd.concat([one, two], axis = 1)

     A    B    C    D
1   A0   B0   C1   D1
2   A1   B1   C2   D2
3   A2   B2   C3   D3
4   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0

In [282]:
## Concatinating along the rows
two.columns = one.columns

In [283]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [284]:
my_df = pd.concat([two, one], axis=0)

In [285]:
my_df.index = np.arange(0, len(my_df.index)) # It will assign the index values to the my_df

In [286]:
my_df

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3
4  A0  B0
5  A1  B1
6  A2  B2
7  A3  B3

### Merging

In [287]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [288]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [289]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [290]:
pd.merge(logins, registrations, how="inner", on="name")

   log_id    name  reg_id
0       2  Andrew       1
1       4    Bobo       2

In [291]:
logins[pd.merge(logins, registrations, how="left", on="name")["reg_id"].isna()]

   log_id     name
0       1   Xavier
2       3  Yolanda

In [292]:
type(pd.merge(logins, registrations, how="right", on="name").loc[0])

pandas.core.series.Series

In [293]:
type(pd.merge(logins, registrations, how="right", on="name")["log_id"])

pandas.core.series.Series

In [294]:
print(pd.merge(logins, registrations, how="right", on="name").loc[0])
print(pd.merge(logins, registrations, how="right", on="name")["log_id"])

log_id       2.0
name      Andrew
reg_id         1
Name: 0, dtype: object
0    2.0
1    4.0
2    NaN
3    NaN
Name: log_id, dtype: float64

In [295]:
pd.merge(logins, registrations, how="outer", on="name")[pd.merge(logins, registrations, how="outer", on="name")["log_id"].isna()]

   log_id    name  reg_id
2     NaN  Claire     3.0
3     NaN   David     4.0

In [296]:
pd.merge(logins, registrations, how="outer", on="name")["log_id"].isna()

0    False
1    False
2     True
3     True
4    False
5    False
Name: log_id, dtype: bool

In [297]:
pd.merge(logins, registrations, how="outer", on="name")

   log_id     name  reg_id
0     2.0   Andrew     1.0
1     4.0     Bobo     2.0
2     NaN   Claire     3.0
3     NaN    David     4.0
4     1.0   Xavier     NaN
5     3.0  Yolanda     NaN

In [298]:
pd.merge(logins, registrations, how="outer", on="name")[pd.merge(logins, registrations, how="outer", on="name")["reg_id"].notna() & pd.merge(logins, registrations, how="outer", on="name")["log_id"].notna()]

   log_id    name  reg_id
0     2.0  Andrew     1.0
1     4.0    Bobo     2.0

In [299]:
pd.merge(left=registrations, right=logins, how="left", on="name")

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [300]:
pd.merge(registrations, logins, how="outer", on="name")

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [301]:
registrations.columns = ["reg_name", "reg_id"]

In [302]:
type(registrations["reg_name"][0])

numpy.int64

In [303]:
results = pd.merge(left=registrations, right=logins, how="inner", left_on="reg_id", right_on="name")

In [304]:
results

   reg_name  reg_id  log_id    name
0         1  Andrew       2  Andrew
1         2    Bobo       4    Bobo

In [305]:
results.drop("reg_name", axis = 1)

   reg_id  log_id    name
0  Andrew       2  Andrew
1    Bobo       4    Bobo

In [306]:
registrations

   reg_name  reg_id
0         1  Andrew
1         2    Bobo
2         3  Claire
3         4   David

In [307]:
registrations.columns = ["id", "name"]

In [308]:
registrations

   id    name
0   1  Andrew
1   2    Bobo
2   3  Claire
3   4   David

In [309]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [310]:
new_df = pd.merge(left = logins, right = registrations, how = "inner", left_on="log_id", right_on="id").drop("log_id", axis=1)

In [311]:
new_df

    name_x  id  name_y
0   Xavier   1  Andrew
1   Andrew   2    Bobo
2  Yolanda   3  Claire
3     Bobo   4   David

In [312]:
new_df.drop([x for x in range(0,2)])

    name_x  id  name_y
2  Yolanda   3  Claire
3     Bobo   4   David

In [313]:
pd.merge(registrations, logins, how="inner", on="name", suffixes=("_reg","_log"))

   id    name  log_id
0   1  Andrew       2
1   2    Bobo       4

In [314]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,1,chevy s-10

In [315]:
df["name"] = df["name"].apply(lambda x: x.upper())

In [316]:
def myFunc(dataFrame):
    return dataFrame["horsepower"] / dataFrame["weight"]
df["power"] = df.apply(myFunc, axis=1)

In [317]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,power
0,18.0,8,307.0,130.0,3504,12.0,70,1,CHEVROLET CHEVELLE MALIBU,0.037100
1,15.0,8,350.0,165.0,3693,11.5,70,1,BUICK SKYLARK 320,0.044679
2,18.0,8,318.0,150.0,3436,11.0,70,1,PLYMOUTH SATELLITE,0.043655
3,16.0,8,304.0,150.0,3433,12.0,70,1,AMC REBEL SST,0.043694
4,17.0,8,302.0,140.0,3449,10.5,70,1,FORD TORINO,0.040591
...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,1,FORD MUSTANG GL,0.030824
394,44.0,4,97.0,52.0,2130,24.6,82,2,VW PICKUP,0.024413
395,32.0,4,135.0,84.0,2295,11.6,82,1,DODGE RAMPAGE,0.036601
396,28.0,4,120.0,79.0,2625,18.6,82,1,FORD RANGER,0.030095
397,31.0,4,119.0,82.0,2720,19.4,82,1,CHEVY S-10,0.030147

In [318]:
df.groupby("model_year").mean("power")["power"].sort_values(ascending=False).index

Index([70, 73, 72, 71, 77, 78, 82, 79, 74, 76, 81, 75, 80], dtype='int64', name='model_year')

In [319]:
tech_finance = ["Google,adsjgoa,asgopaj", "jpm,sıagja,agıa"]

In [320]:
len(tech_finance)

2

In [321]:
my_list = []
for item in tech_finance:
    my_list.append(item.split(","))
for item in my_list:
    print(item)

['Google', 'adsjgoa', 'asgopaj']
['jpm', 'sıagja', 'agıa']

In [322]:
import pandas as pd
ticker = pd.Series(tech_finance)

In [323]:
ticker.str.split(",")[1][0]

'jpm'

In [324]:
import numpy as np

In [325]:
my_arr = pd.DataFrame(np.random.rand(10,10))

In [326]:
my_arr

,0,1,2,3,4,5,6,7,8,9
0,0.229484,0.398879,0.188268,0.376069,0.971821,0.686454,0.774107,0.948272,0.812557,0.482304
1,0.462860,0.515792,0.715030,0.899784,0.420542,0.292391,0.184249,0.978675,0.035455,0.060089
2,0.496527,0.216177,0.755600,0.727211,0.234048,0.424393,0.363522,0.452070,0.032545,0.623909
3,0.876709,0.094764,0.254038,0.697671,0.345416,0.867349,0.956079,0.125637,0.759141,0.170118
4,0.762921,0.603257,0.076010,0.972072,0.709792,0.108225,0.409256,0.001231,0.625923,0.078496
5,0.405586,0.681198,0.773432,0.519711,0.109660,0.420628,0.392353,0.198106,0.036380,0.912198
6,0.005740,0.150245,0.701570,0.539370,0.100003,0.939476,0.144499,0.732089,0.204571,0.853522
7,0.673898,0.560666,0.712837,0.785212,0.336984,0.759895,0.284283,0.214754,0.139048,0.958036
8,0.710232,0.556971,0.993994,0.422478,0.706613,0.796338,0.577845,0.853153,0.173286,0.320273
9,0.038788,0.946708,0.150746,0.226161,0.889761,0.999167,0.017677,0.001209,0.088427,0.364170

In [327]:
from datetime import datetime

In [328]:
my_year = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [329]:
mydate = datetime(2015, 1, 1, 0, 0)

In [330]:
mydatetime = datetime(my_year, mymonth, myday, myhour, mymin, mysec)

In [331]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [332]:
mySer = pd.Series(["Nov 3, 1990", "Nov 3, 1990",None])

In [333]:
mySer

0    Nov 3, 1990
1    Nov 3, 1990
2           None
dtype: object

In [334]:
pd.to_datetime(mySer)

0   1990-11-03
1   1990-11-03
2          NaT
dtype: datetime64[ns]

In [335]:
timeser = pd.to_datetime(mySer)

In [336]:
timeser[0].year

1990

In [337]:
euro_date = "31-12-2000"
us_date = "12-31-2000"

In [338]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-31 00:00:00')

In [339]:
pd.to_datetime(us_date)

Timestamp('2000-12-31 00:00:00')

In [340]:
style_date = "12--Dec--2000"

In [341]:
pd.to_datetime(style_date, format="%d--%b--%Y")

Timestamp('2000-12-12 00:00:00')

In [342]:
custom_date = "12th of Dec 2000"

In [343]:
pd.to_datetime(custom_date, format="%dth of %b %Y")

Timestamp('2000-12-12 00:00:00')

In [344]:
sales = pd.read_csv("examples/RetailSales_BeerWineLiquor.csv")

In [345]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [346]:
sales["DATE"] = pd.to_datetime(sales["DATE"])

In [347]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [348]:
sales["DATE"][0].timestamp()

694224000.0

In [349]:
sales["DATE"][0].year

1992

In [350]:
sales = pd.read_csv("examples/RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [351]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [352]:
sales = sales.set_index("DATE")

In [353]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [354]:
sales.resample(rule="A").mean()

/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/2546798316.py:1: FutureWarning: 'A' is deprecated and will be removed in a future version, please use 'YE' instead.
  sales.resample(rule="A").mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [355]:
pd.DataFrame(np.random.randint(0,10,(10,20)), columns=[f"Column {x + 1}" for x in range(20)], index=[f"Index {x + 1}" for x in range(10)])

,Column 1,Column 2,Column 3,Column 4,Column 5,Column 6,Column 7,Column 8,Column 9,Column 10,Column 11,Column 12,Column 13,Column 14,Column 15,Column 16,Column 17,Column 18,Column 19,Column 20
Index 1,1,3,6,6,4,8,3,8,8,9,8,9,3,0,5,2,2,2,8,5
Index 2,4,5,6,4,8,8,1,5,7,2,0,1,9,3,9,9,8,7,1,9
Index 3,6,1,0,1,9,6,3,5,1,0,7,6,5,3,9,0,7,3,8,8
Index 4,1,0,3,8,6,6,8,9,9,9,3,9,7,2,1,2,6,4,6,1
Index 5,3,8,6,4,5,0,2,7,5,6,1,2,3,0,7,2,9,5,2,6
Index 6,4,6,3,6,4,9,2,5,2,8,2,1,4,9,7,8,6,0,6,7
Index 7,8,5,5,0,3,9,4,7,6,9,6,3,8,5,6,7,5,5,8,8
Index 8,6,5,2,8,5,7,6,9,6,2,8,0,0,5,7,9,8,8,8,6
Index 9,3,6,6,0,4,1,6,2,5,0,2,2,2,6,8,5,2,4,6,4
Index 10,2,2,7,7,7,5,4,0,6,9,7,1,3,2,0,1,6,2,6,1

In [356]:
np.eye(10)

array([[1., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 1.]])

In [357]:
#Reading writing csv files
!ls

1-Numpy.ipynb    README.md        requirements.txt
2-Pandas.ipynb   examples

In [361]:
os.getcwd()

'/Users/kemalozyon/MachineLearning/MLOverView'

In [366]:
os.system("ls -lh examples/")

total 49240
-rw-rw-r--@ 1 kemalozyon  staff   5.3K Jul  2  2020 RetailSales_BeerWineLiquor.csv
-rw-rw-r--@ 1 kemalozyon  staff   1.3K Jul  6  2020 Sales_Funnel_CRM.csv
-rw-rw-r--@ 1 kemalozyon  staff    51B Jul  4  2020 example.csv
-rw-rw-r--@ 1 kemalozyon  staff    24M Jul 12  2020 hotel_booking_data.csv
-rw-rw-r--@ 1 kemalozyon  staff   177B Feb  7  2020 movie_scores.csv
-rw-r--r--@ 1 kemalozyon  staff   171B Nov 17 14:40 movies.csv
-rw-rw-r--@ 1 kemalozyon  staff    17K Jul  1  2020 mpg.csv
-rw-rw-r--@ 1 kemalozyon  staff    51B Jul  4  2020 new_file.csv
-rw-rw-r--@ 1 kemalozyon  staff    51B Sep 25  2020 newfile.csv
-rw-r--r--@ 1 kemalozyon  staff    22K Nov 18 23:12 test.csv
-rw-rw-r--@ 1 kemalozyon  staff    18K Jan 27  2020 tips.csv

0

In [369]:
df = pd.read_csv("examples/example.csv", index_col = 0)

In [370]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [371]:
df.to_csv("examples/newfile.csv")

In [372]:
os.system("cat examples/newfile.csv")

a,b,c,d
0,1,2,3
4,5,6,7
8,9,10,11
12,13,14,15

0

In [373]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [377]:
url = "https://tr.wikipedia.org/wiki/D%C3%BCnya_n%C3%BCfusu"

In [380]:
url = "https://tr.wikipedia.org/wiki/D%C3%BCnya_n%C3%BCfusu"

headers = {
    "User-Agent": (
        "Mozilla/5.0 (Windows NT 10.0; Win64; x64) "
        "AppleWebKit/537.36 (KHTML, like Gecko) "
        "Chrome/120.0.0.0 Safari/537.36"
    )
}
response = requests.get(url, headers=headers)
response.raise_for_status()

In [450]:
tables = pd.read_html(response.text)

/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/3072015354.py:1: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  tables = pd.read_html(response.text)

In [451]:
tables[0]

,Sıra,Ülke,Nüfus,Yüzde,Tarih,Kaynak
0,1.0,Hindistan,1.425.775.850,"%17,8",14 Nisan 2023,[36]
1,2.0,Çin,1.412.600.000,"%17,6",31 Aralık 2021,[37]
2,3.0,Amerika Birleşik Devletleri,334.633.076,"%4,17",16 Nisan 2023,[38]
3,4.0,Endonezya,275.773.800,"%3,44",1 Temmuz 2022,[39]
4,5.0,Pakistan,229.488.994,"%2,86",1 Temmuz 2022,[40]
5,6.0,Nijerya,216.746.934,"%2,70",1 Temmuz 2022,[40]
6,7.0,Brezilya,216.024.545,"%2,69",16 Nisan 2023,[41]
7,8.0,Bangladeş,168.220.000,"%2,10",1 Temmuz 2020,[42]
8,9.0,Rusya,146.188.000,"%1,83",2 Haziran 2023,[43]
9,10.0,Meksika,128.271.248,"%1,60",31 Mart 2022,[44]

In [452]:
tables[1] = tables[1].drop("Mevcut nüfusu en yüksek olan beş ülkenin 1901–2021 yılları arasındaki nüfus grafiği.", axis=1)

/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/3521238308.py:1: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.
  tables[1] = tables[1].drop("Mevcut nüfusu en yüksek olan beş ülkenin 1901–2021 yılları arasındaki nüfus grafiği.", axis=1)

In [453]:
tables[1].columns

MultiIndex([(                     '#',                    '#', ...),
            (  'En kalabalık ülkeler', 'En kalabalık ülkeler', ...),
            ('Yıllara göre nüfusları',                 '2000', ...),
            ('Yıllara göre nüfusları',                 '2015', ...),
            ('Yıllara göre nüfusları',                 '2023', ...),
            ('Yıllara göre nüfusları',                 '2030', ...)],
           )

In [454]:
tables[1].columns = ["#", "En kalabalık ülkeler", "2000", "2015","2023","2030"]

In [455]:
tables[1]

                      #         En kalabalık ülkeler  2000  2015  2023  2030
0                     1                    Hindistan  1053  1311  1425  1528
1                     2                          Çin  1270  1376  1412  1416
2                     3  Amerika Birleşik Devletleri   283   322   335   356
3                     4                    Endonezya   212   258   275   295
4                     5                     Pakistan   136   208   229   245
5                     6                     Brezilya   176   206  2167   228
6                     7                      Nijerya   123   182  2165   263
7                     8                    Bangladeş   131   161   168   186
8                     9                        Rusya   146   146   147   149
9                    10                      Meksika   103   127   128   148
10  Toplam dünya nüfusu          Toplam dünya nüfusu  6127  7349  8053  8501

In [456]:
tables[1] = tables[1].drop(10)

In [457]:
tables[1]

    #         En kalabalık ülkeler  2000  2015  2023  2030
0   1                    Hindistan  1053  1311  1425  1528
1   2                          Çin  1270  1376  1412  1416
2   3  Amerika Birleşik Devletleri   283   322   335   356
3   4                    Endonezya   212   258   275   295
4   5                     Pakistan   136   208   229   245
5   6                     Brezilya   176   206  2167   228
6   7                      Nijerya   123   182  2165   263
7   8                    Bangladeş   131   161   168   186
8   9                        Rusya   146   146   147   149
9  10                      Meksika   103   127   128   148

In [448]:
for x in tables[1].columns[2:]:
    tables[1].loc[len(tables[1])] = tables[1][x].sum() - tables[1][tables[1]["En kalabalık ülkeler"] == "Toplam dünya nüfusu"][x]

In [458]:
df = tables[1]

In [459]:
df

    #         En kalabalık ülkeler  2000  2015  2023  2030
0   1                    Hindistan  1053  1311  1425  1528
1   2                          Çin  1270  1376  1412  1416
2   3  Amerika Birleşik Devletleri   283   322   335   356
3   4                    Endonezya   212   258   275   295
4   5                     Pakistan   136   208   229   245
5   6                     Brezilya   176   206  2167   228
6   7                      Nijerya   123   182  2165   263
7   8                    Bangladeş   131   161   168   186
8   9                        Rusya   146   146   147   149
9  10                      Meksika   103   127   128   148

In [466]:
df.loc[len(df)] = [11, "Turkey", 1,2,3,4]

In [467]:
df

     #         En kalabalık ülkeler  2000  2015  2023  2030
0    1                    Hindistan  1053  1311  1425  1528
1    2                          Çin  1270  1376  1412  1416
2    3  Amerika Birleşik Devletleri   283   322   335   356
3    4                    Endonezya   212   258   275   295
4    5                     Pakistan   136   208   229   245
5    6                     Brezilya   176   206  2167   228
6    7                      Nijerya   123   182  2165   263
7    8                    Bangladeş   131   161   168   186
8    9                        Rusya   146   146   147   149
9   10                      Meksika   103   127   128   148
10  11                       Turkey     1     2     3     4

In [470]:
df = df.drop(10)

In [474]:
df["2000"].iloc[9] = 104

/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/1033460486.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["2000"].iloc[9] = 104
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/1033460486.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["2000"].iloc[9] = 104

In [477]:
df["2000"].loc[9] = 103

/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/1105879870.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["2000"].loc[9] = 103
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/1105879870.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["2000"].loc[9] = 103

In [478]:
df

    #         En kalabalık ülkeler  2000  2015  2023  2030
0   1                    Hindistan  1053  1311  1425  1528
1   2                          Çin  1270  1376  1412  1416
2   3  Amerika Birleşik Devletleri   283   322   335   356
3   4                    Endonezya   212   258   275   295
4   5                     Pakistan   136   208   229   245
5   6                     Brezilya   176   206  2167   228
6   7                      Nijerya   123   182  2165   263
7   8                    Bangladeş   131   161   168   186
8   9                        Rusya   146   146   147   149
9  10                      Meksika   103   127   128   148

In [480]:
df.loc[len(df)] = [11, "Total", 1,1,1,1]

In [481]:
df

     #         En kalabalık ülkeler  2000  2015  2023  2030
0    1                    Hindistan  1053  1311  1425  1528
1    2                          Çin  1270  1376  1412  1416
2    3  Amerika Birleşik Devletleri   283   322   335   356
3    4                    Endonezya   212   258   275   295
4    5                     Pakistan   136   208   229   245
5    6                     Brezilya   176   206  2167   228
6    7                      Nijerya   123   182  2165   263
7    8                    Bangladeş   131   161   168   186
8    9                        Rusya   146   146   147   149
9   10                      Meksika   103   127   128   148
10  11                        Total     1     1     1     1

In [484]:
for x in df.columns[2:]:
    df[x].loc[len(df) - 1] = df[:-2][x].sum()

/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[x].loc[len(df) - 1] = df[:-2][x].sum()
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x].loc[len(df) - 1] = df[:-2][x].sum()
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[x].loc[len(df) - 1] = df[:-2][x].sum()
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x].loc[len(df) - 1] = df[:-2][x].sum()
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[x].loc[len(df) - 1] = df[:-2][x].sum()
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x].loc[len(df) - 1] = df[:-2][x].sum()
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[x].loc[len(df) - 1] = df[:-2][x].sum()
/var/folders/xc/rfws523562j79_1wnw1hgt_c0000gn/T/ipykernel_83120/927624779.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x].loc[len(df) - 1] = df[:-2][x].sum()

In [485]:
df

     #         En kalabalık ülkeler  2000  2015  2023  2030
0    1                    Hindistan  1053  1311  1425  1528
1    2                          Çin  1270  1376  1412  1416
2    3  Amerika Birleşik Devletleri   283   322   335   356
3    4                    Endonezya   212   258   275   295
4    5                     Pakistan   136   208   229   245
5    6                     Brezilya   176   206  2167   228
6    7                      Nijerya   123   182  2165   263
7    8                    Bangladeş   131   161   168   186
8    9                        Rusya   146   146   147   149
9   10                      Meksika   103   127   128   148
10  11                        Total  3530  4170  8323  4666

In [489]:
df = df.drop("#", axis=1)

In [487]:
df.index = np.arange(1, len(df) + 1)

In [490]:
df

           En kalabalık ülkeler  2000  2015  2023  2030
1                     Hindistan  1053  1311  1425  1528
2                           Çin  1270  1376  1412  1416
3   Amerika Birleşik Devletleri   283   322   335   356
4                     Endonezya   212   258   275   295
5                      Pakistan   136   208   229   245
6                      Brezilya   176   206  2167   228
7                       Nijerya   123   182  2165   263
8                     Bangladeş   131   161   168   186
9                         Rusya   146   146   147   149
10                      Meksika   103   127   128   148
11                        Total  3530  4170  8323  4666

In [492]:
df["En kalabalık ülkeler"] = df["En kalabalık ülkeler"].apply(lambda x : x.upper())

In [493]:
df

           En kalabalık ülkeler  2000  2015  2023  2030
1                     HINDISTAN  1053  1311  1425  1528
2                           ÇIN  1270  1376  1412  1416
3   AMERIKA BIRLEŞIK DEVLETLERI   283   322   335   356
4                     ENDONEZYA   212   258   275   295
5                      PAKISTAN   136   208   229   245
6                      BREZILYA   176   206  2167   228
7                       NIJERYA   123   182  2165   263
8                     BANGLADEŞ   131   161   168   186
9                         RUSYA   146   146   147   149
10                      MEKSIKA   103   127   128   148
11                        TOTAL  3530  4170  8323  4666

In [502]:
df["2000"] = df["2000"].apply(lambda x : float(x))

In [506]:
df[df.columns[2:]] = df[df.columns[2:]].astype(float)

In [507]:
df

           En kalabalık ülkeler    2000    2015    2023    2030
1                     HINDISTAN  1053.0  1311.0  1425.0  1528.0
2                           ÇIN  1270.0  1376.0  1412.0  1416.0
3   AMERIKA BIRLEŞIK DEVLETLERI   283.0   322.0   335.0   356.0
4                     ENDONEZYA   212.0   258.0   275.0   295.0
5                      PAKISTAN   136.0   208.0   229.0   245.0
6                      BREZILYA   176.0   206.0  2167.0   228.0
7                       NIJERYA   123.0   182.0  2165.0   263.0
8                     BANGLADEŞ   131.0   161.0   168.0   186.0
9                         RUSYA   146.0   146.0   147.0   149.0
10                      MEKSIKA   103.0   127.0   128.0   148.0
11                        TOTAL  3530.0  4170.0  8323.0  4666.0

In [509]:
df.to_html("examples/test.html", index=False)

In [510]:
!open examples/test.html

In [514]:
df = pd.read_excel("examples/my_excel_file.xlsx")

In [515]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [516]:
wb = pd.ExcelFile("examples/my_excel_file.xlsx")

In [518]:
wb.sheet_names

['First_Sheet']

In [520]:
excel_sheet_dict = pd.read_excel("examples/my_excel_file.xlsx", sheet_name=None)

In [521]:
type(excel_sheet_dict)

dict

In [522]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [523]:
df.to_excel("examples/example.xlsx", sheet_name="First", index=False)

In [526]:
new_df = pd.read_excel("examples/example.xlsx", sheet_name="First")

In [527]:
new_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Pandas with SQL

In [529]:
from sqlalchemy import create_engine

In [530]:
engine = create_engine("sqlite:///foo.db")

In [533]:
df = pd.DataFrame(data=np.random.randint(0,100,(4,4)), columns=list("abcd"))

In [539]:
df.to_sql(name="new_table2", con=engine, index=False)

4

In [542]:
pd.read_sql(sql="new_table2", con=engine)

    a   b   c   d
0  12  68  87  13
1  18   4  89  22
2  40   7   2  83
3  19  68  89  16

In [545]:
pd.read_sql_query(sql="select a, b * 3 as \" three b\" from new_table2", con=engine)

    a   three b
0  12       204
1  18        12
2  40        21
3  19       204

In [546]:
df

    a   b   c   d
0  12  68  87  13
1  18   4  89  22
2  40   7   2  83
3  19  68  89  16